read_verilog /tmp/dexter_cv32_regfile_readmask_idstage_gate_bundle/cv32e40p_id_stage_gate_bundle.v
hierarchy -check -top cv32e40p_id_stage
proc
opt
fsm
opt
memory
opt
techmap
opt
dfflibmap -liberty <local>/.main-6b922e97/src/kairos/data/liberty/sky130_fd_sc_hd__tt_025C_1v80.lib
opt
abc -liberty <local>/.main-6b922e97/src/kairos/data/liberty/sky130_fd_sc_hd__tt_025C_1v80.lib
opt
flatten
clean
write_verilog -noattr /tmp/dexter_cv32_regfile_readmask_idstage_gate_selected/generated/cv32e40p_id_stage_mapped.v
setundef -zero
splitnets
clean
write_verilog -noattr -noexpr -nohex -nodec -simple-lhs /tmp/dexter_cv32_regfile_readmask_idstage_gate_selected/generated/cv32e40p_id_stage_sta.v
check
tee -o /tmp/dexter_cv32_regfile_readmask_idstage_gate_selected/reports/area.rpt stat -liberty <local>/.main-6b922e97/src/kairos/data/liberty/sky130_fd_sc_hd__tt_025C_1v80.lib
