
read_verilog -sv compressed_decoder_full_miter.sv
prep -top compressed_decoder_full_miter -flatten
sat -prove diff_o 0 -show instr_i,diff_o
